/*
*********************************************************************************************************
*
*	模块名称 : 数据观察点与跟踪(DWT)模块
*	文件名称 : bsp_dwt.h
*	??   ??: V1.0
*	??   ??: 头文??
*	修改记录 :
*		版本??   日期        作??    说明
*		V1.0    2015-08-18   Eric2013 正式发布
*
*	Copyright (C), 2015-2020, 安富莱电??www.armfly.com
*
*********************************************************************************************************
*/

#ifndef __BSP_DWT_H__
#define __BSP_DWT_H__

#include "sys.h"


/*
*********************************************************************************************************
*                                             寄存??
*********************************************************************************************************
*/
#define  DWT_CYCCNT  *(volatile unsigned int *)0xE0001004
#define  DWT_CR      *(volatile unsigned int *)0xE0001000
#define  DEM_CR      *(volatile unsigned int *)0xE000EDFC
#define  DBGMCU_CR   *(volatile unsigned int *)0xE0042004

#define  DEM_CR_TRCENA               (1 << 24)
#define  DWT_CR_CYCCNTENA            (1 <<  0)


/*
*********************************************************************************************************
*                                             函数
*********************************************************************************************************
*/
void bsp_InitDWT(void);
void bsp_DelayUS(uint32_t _ulDelayTime);
void bsp_DelayMS(uint32_t _ulDelayTime);

#endif

/***************************** 安富莱电??www.armfly.com (END OF FILE) *********************************/
